<template>
    <b-container class="page-content">
        <div class="privacy-page">
            <h3 class="page-title font-weight-bold">プライバシーポリシー</h3>
            <p class="ml-3 mt-3">
                マチアプ（以下「運営」といいます）では、運営の提供するサービスをご利用されるユーザーの個人情報の取扱について以下のとおり定め、個人情報の保護に努めてまいります。
            </p>
            <div class="main-content px-1 px-lg-3">
                <h4>1.定義</h4>
                <p>
                    このプライバシーポリシーにおいて、個人情報とは生存する個人に関する情報であり、
                    当該情報に含まれる氏名、生年月日、IDその他の記述などにより、個人が特定できるものをいいます。
                </p>
                <h4>2.個人情報の利用目的について</h4>
                <p>
                    運営は、以下の利用目的のためにユーザーの個人情報を収集します。<br><br>
                    運営サービスを提供するため
                    ログイン時における本人認証、その他運営サービスの運営に必要な管理のため
                    お客様への連絡、メールによる各種情報の提供を行うため
                    運営サービスの利用規約に違反する行為への対応及び当該違反行為の防止のため
                    運営サービスに関する運営の規約、ポリシー等の変更等をお客様に通知するため
                    紛争、訴訟などへの対応のため
                    運営サービスに関するご案内、お客様からのお問い合わせ等への対応のため
                </p>
                <h4>3.個人情報の第三者提供について</h4>
                <p>
                    法令に定める場合を除き、個人情報を事前に本人の同意を得ることなく第三者に提供することは行いません。
                </p>
                <h4>4.個人情報の管理について</h4>
                <p>
                    収集された個人情報は適切な管理の下で安全に蓄積・保管し、不正アクセス、紛失、 破壊、改竄、漏洩などの危険に対して適切に技術的、組織的な予防および対策を講じます。 
                    個人情報もしくは情報システムを取り扱う業務を外部に委託する場合には、委託先の厳正な管理監督の下で行います。
                </p>
                <h4>5.個人情報の開示・訂正・利用停止・消去・苦情について</h4>
                <p>
                    運営は、本人が自己の個人情報について、開示・訂正・利用停止・消去などを求める権利を有していることを確認し、 
                    「個人情報取扱に関するお問い合わせ窓口」を設け、これらの要求や苦情に対して速やかに対処します。
                </p>
            </div>
        </div>
    </b-container>
</template>
<style lang="scss" scoped>
.privacy-page {
    padding: 50px 10px;
    .page-title {
        border-bottom: 2px solid #747a7b;
        font-size: 24px;
        padding-bottom: 10px;
    }
    .main-content {
        h4 {
            font-size: 18px;
            font-weight: 600;
            margin-bottom: 15px;
        }
        p {
            margin: 0 0 28px 14px;
            line-height: 1.8;
        }
    }
}
</style>