<template>
    <b-container class="page-content">
        <div class="terms-page">
            <h3 class="page-title font-weight-bold">利用規約</h3>
            <p class="ml-3 mt-3">
                マチアプは、下記の利用規約に同意された方のみ提供させていただくサービスです。
                当サービスを利用することで、下記の利用規約に同意していただいたこととみなさせていただきますのでご注意ください。
            </p>
            <div class="main-content px-1 px-lg-3">
                <h4>規約の適用</h4>
                <p>本規約はマチアプに関して、本サービスをご利用されるユーザーに対して、以下のとおり利用規約を定めます。</p>
                <h4>規約の変更</h4>
                <p>
                    (1) &nbsp;マチアプはユーザーの了解を得ることなく本規約を変更することがあります。この場合、本サービスの利用条件は、変更後の本規約によるものとします。<br>
                    (2) &nbsp;変更後の規約は、別途定める場合を除き、本サイト上に表示した時点より、効力を生じるものとします。
                </p>
                <h4>通知</h4>
                <p>マチアプからユーザーへの通知は、電子メールの送信、または本サイトに掲載する方法により行うものとします。
                    通知は、マチアプがメール送信した時点または本サイトへ掲載した時点で効力を発するものとします。</p>
                <h4>利用者登録</h4>
                <p>マチアプ利用希望者は、申し込みフォームに必要事項を正しく記入した上で申し込むものとし、マチアプから利用者登録が完了した旨を通知された時点で利用者となり、
                    本規約の条件による本サービスの利用の許可がマチアプより利用者に有効に付与されるものとします。</p>
                <h4>IDやパスワード等の管理</h4>
                <p>ユーザーは、発行されたID及びパスワードを、マチアプの事前承諾を得ることなく、第三者に譲渡、貸与若しくは開示しまたは使用させることはできません。 
                    ユーザーは、自己の責任においてID及びパスワードを管理、使用するものとします。
                    万一、利用者によるID及びパスワードの管理または利用が不適切であったことが原因で、ユーザーに不利益が生じても、マチアプは一切責任を負わないものとします。</p>
                <h4>禁止行為</h4>
                <p>マチアプは、ユーザーが次の各号のいずれかに該当すると判断した場合、ユーザーへの事前の通知若しくは催告を要することなく、利用禁止処分または本利用規約の全部若しくは一部を解約することができるものとします。</p>
                <h4>マチアプの運営を妨害する行為。</h4>
                <p>
                    (1) &nbsp; 虚偽の情報を登録・記入・送信する行為。<br>
                    (2) &nbsp; 過去に本利用規約違反等の理由によりユーザー資格の取り消しを受けていたにも関わらず、ユーザー登録の申込をする行為。<br>
                    (3) &nbsp; コンピュータ・ウィルス等の有害なコンピュータプログラム等を送信または頒布する行為、チェーンメール・スパムメール等の送信を目的とする行為、並びにマチアプに著しく負荷のかかる行為。<br>
                    (4) &nbsp; 本サービスにより利用しうる情報を改ざんまたは消去する行為。<br>
                    (5) &nbsp; マチアプまたは第三者の財産、プライバシー、名誉または肖像権を侵害する行為、または侵害するおそれのある行為、ストーカー的行為。<br>
                    (6) &nbsp; マチアプまたは第三者を差別・誹謗中傷し、その名誉または信用を毀損する行為、並びに人種的・民族的・宗教的に不快感を与える行為。<br>
                    (7) &nbsp; わいせつな映像・画像等の配信またはそれらを掲載する他のウェブサイトへの誘導をする行為。<br>
                    (8) &nbsp; その他、公序良俗に違反し、または他者の権利を侵害するとマチアプが判断した行為。<br>
                    (9) &nbsp; その他マチアプが不適切であると判断する行為。
                </p>
                <h4>サービスの一時的な中断</h4>
                <p>
                    (1) &nbsp; マチアプは、次の各号いずれかの事由に該当する場合、ユーザーに事前に通知することなく、一時的にマチアプの運営を中断することがあります。<br>
                    (2) &nbsp; マチアプまたは関連設備の保守を定期的または緊急に行うとき。<br>
                    (3) &nbsp; マチアプで利用する通信回線、電力等の提供が中断されたとき。<br>
                    (4) &nbsp; 火災、停電、地震、台風、洪水、津波等の天災や疫病の発生等、マチアプが支配できない事情（マチアプが利用しているサーバーで生じた事情を含みます。）によりマチアプの運営ができないとき。<br>
                    (5) &nbsp; その他マチアプが必要と判断したとき。<br>
                    (6) &nbsp; マチアプは、理由を問わず、マチアプの運営の遅滞、中断または停止に起因して、ユーザー、顧客または第三者が被った損害について、一切責任を負わないものとします。<br>
                </p>
                <h4>損害賠償</h4>
                <p>本利用規約の履行に際し、マチアプがユーザーに対する損害賠償義務を負う場合、マチアプはユーザーに現実に生じた通常損害（直接損害に限ります）に対して、ユーザーが過去1年間にマチアプに支払った利用代金の総額を限度額として責任を負うものとします。
                    マチアプはマチアプの予見の有無を問わず、逸失利益、間接損害や特別の事情により生じた損害については、ユーザーに対する賠償責任を負わないものとします。</p>
                <h4>免責事項</h4>
                <p>
                    マチアプの利用において、ユーザーの責によりマチアプその他の第三者に損害が発生した場合または権利が侵害された場合、ユーザーは自己の費用と責任においてこれを解決するものとし、マチアプ及び当該第三者に損害を賠償することとします。
                    天災地変、戦争・暴動・内乱、法令の制定・改廃、公権力による命令・処分、ストライキ等の争議行為、輸送機関の事故、その他当事者の責に帰し得ない事由による本利用規約に基づく債務の履行の遅滞または不能が生じた場合は、当該当事者はその責を負わないものとします。<br>
                    マチアプは、ユーザーに対し、以下の各号に該当する損害、ならびに以下の各号に付随する２次的なデータの漏洩、損失、損害にかかる損害について責任を負わないものとします。<br>
                    (1) &nbsp; マチアプが提供していないプログラムによって生じる損害。<br>
                    (2) &nbsp; マチアプ以外の第三者による不正な行為によって生じる損害。<br>
                    (3) &nbsp; ハッカー及びクラッカーによるサーバーへの侵入または攻撃等の行為による損害。<br>
                    (4) &nbsp; マチアプがマチアプのために用いるサーバーにおいて生じた事情により生じる損害。<br>
                    (5) &nbsp; マチアプのバグによって生じる損害。
                    マチアプは、マチアプについて、その完全性、特定目的適合性、その他一切保証しないものとします。マチアプは、マチアプや本サイトの提供が中断することなく継続することを保証しません。
                    マチアプは、マチアプや本サイトの提供が停止または中止した場合も、ユーザーや第三者に生じた損害について責任を負いません。<br>
                    マチアプは、マチアプにユーザーがアップロードするデータ・情報に関しては、一切責任を負わないものとします。
                    マチアプにアップロードするデータ・情報の正確性や当該情報をアップデートする責任は、全てユーザーにあります。<br>
                    マチアプは、本サイトでの広告の表示・掲載を、第三者について行う場合があります。
                    ユーザーが、本サイトでの広告を通じて第三者から商品・サービスを購入する等、第三者と何らかの契約をされる場合、当該契約の当事者はユーザーと第三者であり、マチアプはいかなる責任も負いません。<br>
                    ユーザーは、マチアプにおいて保存するデータについて、自らバックアップを行う義務を負います。マチアプは、マチアプにおいて、マチアプの管理下にあるインターネットサーバーに保管・蓄積されるユーザーのデータについてバックアップを行いますが、
                    マチアプによるバックアップにも関わらず、マチアプに保管・蓄積されたユーザーのデータが消失、毀損した場合には、マチアプは、ユーザーや第三者に対していかなる責任も負いません。
                </p>
                <h4>本サービスの終了</h4>
                <p>
                    マチアプは、相当の周知期間をもってユーザーに通知の上、利用者に対する本サービス及び本サービスの一部を終了することができるものとします。<br>
                    前項の通知は、本サイト上での掲示及び利用者への電子メールやWebサイト上への掲載によるものとします。<br>
                    マチアプはユーザーに対する通知後、本サービスを終了した場合には、利用者に対して本サービスは終了に伴い生じる損害、損失、その他の費用の賠償または補償を免れるものとします。
                </p>
                <h4>合意管轄等</h4>
                <p>本利用規約の準拠法は日本法とし、本利用規約及びマチアプに関する一切の紛争について訴訟の必要が生じた場合、東京地方裁判所を第一審の専属的合意管轄裁判所とします。</p>
                <h4>附則</h4>
                <p>2021年2月14日 改定</p>
            </div>
        </div>
    </b-container>
</template>
<style lang="scss" scoped>
.terms-page {
    padding: 50px 10px;
    .page-title {
        border-bottom: 2px solid #747a7b;
        font-size: 25px;
        padding-bottom: 10px;
    }
    .main-content {
        h4 {
            font-size: 18px;
            font-weight: 600;
            margin-bottom: 15px;
        }
        p {
            margin: 0 0 28px 14px;
            line-height: 1.8;
        }
    }
}
</style>